Revit 2027 API
ReferenceArrayArray.Item Property
Gets or sets a ReferenceArray at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ReferenceArray this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As ReferenceArray
	Get
	Set
public:
virtual property ReferenceArray^ Item[int index] {
	ReferenceArray^ get (int index);
	void set (int index, ReferenceArray^ value);
}
abstract Item : ReferenceArray with get, set
override Item : ReferenceArray with get, set
Parameters
index Int32
The index of the ReferenceArray to be set or retrieved.
Return Value
ReferenceArray
Returns the ReferenceArray at the specified index.
See Also
Reference
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace